In [1]:
import pandas as pd

In [21]:
data = {"name":["a","b","c","d","a","e"], "eng":[6,7,4,5,6,5], "hindi":[2,4,5,6,2,9]}

In [22]:
df = pd.DataFrame(data)
df

  name  eng  hindi
0    a    6      2
1    b    7      4
2    c    4      5
3    d    5      6
4    a    6      2
5    e    5      9

In [9]:
# df["Duplicates"] = df.duplicated()

In [25]:
df.drop_duplicates(inplace=True)
df

  name  eng  hindi
0    a    6      2
1    b    7      4
2    c    4      5
3    d    5      6
5    e    5      9

In [26]:

dataSet = pd.read_csv("loan.csv")
dataSet.head(4)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban

In [27]:
dataSet.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
362    False
363    False
364    False
365    False
366    False
Length: 367, dtype: bool

In [28]:
dataSet.shape

(367, 12)

In [29]:
dataSet.drop_duplicates(inplace=True)
dataSet.shape

(367, 12)